app/controllers/api/teams_controller.rb

SELECT "teams".* FROM "teams" INNER JOIN "user_team_relationships" ON "teams"."id" = "user_team_relationships"."team_id" WHERE "user_team_relationships"."user_id" = ?  [["user_id", 1]]
---
  def index
    render json: current_user.teams.all, methods: [:team_avatar_url]