app/controllers/api/team/events_controller.rb

  def index
    render json: Team.find(1).events.all
---
SELECT "events".* FROM "events" WHERE "events"."team_id" = ?  [["team_id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    teams = current_user.teams.all
    current_team = teams.find_by(id: params[:id])
    render json: current_team.events.all
---
SELECT "teams".* FROM "teams" INNER JOIN "user_team_relationships" ON "teams"."id" = "user_team_relationships"."team_id" WHERE "user_team_relationships"."user_id" = ? AND "teams"."id" = ? LIMIT ?  [["user_id", 1], ["id", nil], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."team_id" = ?  [["team_id", 1]]