app/controllers/api/team/messages_controller.rb

SELECT "teams".* FROM "teams" INNER JOIN "user_team_relationships" ON "teams"."id" = "user_team_relationships"."team_id" WHERE "user_team_relationships"."user_id" = ?  [["user_id", 1]]
SELECT "teams".* FROM "teams" INNER JOIN "user_team_relationships" ON "teams"."id" = "user_team_relationships"."team_id" WHERE "user_team_relationships"."user_id" = ? AND "teams"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."team_id" = ?  [["team_id", 2]]
---
  def show
    teams = current_user.teams.all
    current_team = teams.find_by(id: params[:id])
    render json: current_team.messages.all, methods: [:message_user_avatar]

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ?  [["user_id", 1]]
---
  def destroy
    message = current_user.messages.find_by(id: params[:id])