app/controllers/api/team/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."team_id" = ?  [["team_id", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    render json: Team.find(1).messages.all