app/controllers/api/user/team_controller.rb

SELECT "teams".* FROM "teams" INNER JOIN "user_team_relationships" ON "teams"."id" = "user_team_relationships"."team_id" WHERE "user_team_relationships"."user_id" = ? AND "teams"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def index
    render json: current_user.teams.all