app/controllers/events_controller.rb

  def index
    render json: current_user.events.all
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 1]]

  def show
    render json: current_user.events.find_by(id: params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    # @user = current_user
    event = current_user.events.new(event_params)
    if event.save
---
INSERT INTO "events" ("user_id", "name", "start", "end", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    event = current_user.events.find_by(id: params[:id])
    if event.update(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "北海道\n更新"], ["updated_at", "2022-02-06 10:05:01.085913"], ["id", 7]]

  def destroy
    # 指定したidのイベントデータを削除する
    event = current_user.events.find_by(id: params[:id])
    event.destroy!
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 5]]