app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = ?  [["user_id", 1]]
---
  def index
    render json: current_user.messages.all

SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    render json: current_user.messages.find_by(id: params[:id])

INSERT INTO "messages" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["title", "aaa"], ["content", "aaaaa"], ["created_at", "2022-02-14 08:15:38.093831"], ["updated_at", "2022-02-14 08:15:38.093831"]]
---
  def create
    message = current_user.messages.new(message_params)
    if message.save